## Plan for tf_roles
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.terragrunt will be created
  + resource "aws_iam_policy" "terragrunt" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Terragrunt"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:1234567890:table/terraform-state-lock-dynamo"
                      + Sid      = "AllowAllDynamoDBActionsOnAllTerragruntTables"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::scan-websites-production-tf/*",
                          + "arn:aws:s3:::scan-websites-production-tf",
                        ]
                      + Sid      = "AllowAllS3ActionsOnTerragruntBuckets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.terragrunt will be created
  + resource "aws_iam_role_policy_attachment" "terragrunt" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gh_plan_role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.terragrunt"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
